In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('billing.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132000 entries, 0 to 131999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   customerid    132000 non-null  int64
 1   category      132000 non-null  object
 2   country       132000 non-null  object
 3   industry      132000 non-null  object
 4   month         132000 non-null  object
 5   billedamount  132000 non-null  int64
dtypes: int64(2), object(4)
memory usage: 6.0+ MB

In [4]:
df.head()

,customerid,category,country,industry,month,billedamount
0,1,Individual,Indonesia,Engineering,2009-1,5060
1,614,Individual,United States,Product Management,2009-1,9638
2,615,Individual,China,Services,2009-1,11573
3,616,Individual,Russia,Accounting,2009-1,18697
4,617,Individual,Chile,Business Development,2009-1,944

In [5]:
df.describe()

          customerid   billedamount
count  132000.000000  132000.000000
mean      500.500000   10001.672311
std       288.676084    5765.753383
min         1.000000       0.000000
25%       250.750000    5009.000000
50%       500.500000   10016.500000
75%       750.250000   14984.000000
max      1000.000000   20000.000000

small int: â€“32,767 to 32,767

#### count max length of all columns's values

In [9]:
for column in df:
    print(column,":", df[column].astype(str).str.len().max())

customerid : 4
category : 10
country : 24
industry : 24
month : 7
billedamount : 5